Examples/ConservativeDBSPaper/DNS/micromodel_1200by1200_heteroSquares/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     heatTransportFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20000;

deltaT          1;

writeControl    adjustable;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

functions
{
    velocityProfile
    {
        type            sets;
        libs            ("libsampling.so");
        writeControl    onEnd;
        interpolationScheme cellPoint;
        setFormat       csv;
        sets
        (
            line_xmid
            {
                type     uniform;
                axis     y;
                start    (0.00063 0.0005 0.0000005);
                end      (0.00063 0.0007 0.0000005);
                nPoints  600;
            }
        );
        fields          ( U );
    }
}



// ************************************************************************* //
