Examples/ConservativeDBSPaper/DNS/micromodel_1200by1200_heteroSquares/Allrun.sh
./createMesh.sh
./initCaseFlow.sh
./runCaseFlow.sh
./processFlow.sh
